export class Data{
    constructor(){
        this.data = this.createData();
    }

    createData(){
        const data = [
        {
            "id": "A076263",
            "name": "Треугольник, читаемый по строкам: T(n,k) = количество неизоморфных связных графов с n вершинами и k рёбрами",
            "terms": [1, 1, 1, 1, 2, 1, 1, 3, 5, 5, 4, 2, 1, 1, 6, 13, 19, 22, 20, 14, 9, 5, 2, 1, 1, 11, 33, 67, 107, 132, 138, 126, 95, 64, 40, 21, 10, 5, 2, 1],
            "keywords": ["неотр", "табл", "граф", "связный", "треугольник", "вершины", "рёбра", "арбёр", "ртоен"],
            "author": "Арне Ринг"
        },
        {
            "id": "A000040",
            "name": "Простые числа.",
            "terms": [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97],
            "keywords": ["ключ", "неотр", "легк", "изящ", "простые", "ecin"],
            "author": "Н. Дж. А. Слоун"
        },
        {
            "id": "A000045",
            "name": "Числа Фибоначчи: F(n) = F(n-1) + F(n-2), где F(0) = 0 и F(1) = 1.",
            "terms": [0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597],
            "keywords": ["ключ", "неотр", "легк", "изящ", "фибоначчи"],
            "author": "Н. Дж. А. Слоун"
        }
    ]
        return data
    }
    getData(){
        return this.data
    }    
}
